# Taps
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'

# Install Bash 4
brew 'bash'
brew 'bash-completion2'

# Install Utils
brew 'coreutils'
brew 'findutils'
brew 'gnu-sed', args: ["with-default-names"]
brew 'awscli'
brew 'git'
brew 'bash-git-prompt'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'wget'
brew 'moreutils'
brew 'grep'
brew 'vim', args: ["with-override-system-vi"]
brew 'openssl'
brew 'screen'
brew 'jq'
brew 'md5sha1sum'
brew 'packer'
brew 'redis'
brew 'ssh-copy-id'
brew 'tmux'
brew 'autoenv'
brew 'stow'
brew 'watch'

# Development
brew 'python'
brew 'python3'
brew 'terraform'
brew 'tfenv'

# Apps
cask 'atom'
cask 'alfred'
cask 'caffeine'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'gpgtools'
cask 'iterm2'
cask 'slack'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'p4merge'
cask '1password'
cask 'pycharm'

# Fonts
cask 'font-inconsolata'

# Install Mac App Store apps

